/*
Напишите программу, которая на вход принимает 
число и выдаёт его квадрат 
(число умноженное на само себя).
*/

//Console.WriteLine("Hello, World!");
Console.WriteLine("Введите число");
int num = Convert.ToInt32(Console.ReadLine());
int num2 = num * num;
Console.WriteLine(num2);